name: "wav2vec2"
backend: "tensorrt"
max_batch_size: 8

input [
  {
    name: "input_values"
    data_type: TYPE_FP32
    dims: [ 16000 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]